Revit 2026 API

# DocumentFailures Properties

---

The BuiltInFailuresDocumentFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApiDelayedUpdateFailed | Delayed Updating Failed. Please contact the 3rd Party Application vendor. |
|  | CannotAutoUpdate | Coordination Monitor can't update element |
|  | CannotLoadLink | Can't load Linked File [Name] due to errors. Open it separately to investigate the problem. |
|  | DUExcessiveRegeneration | Third party updater '[Name]' has caused an infinite loop and its action had to be canceled. |
|  | DUMisbehavingUpdater | Third party updater '[Name]' has experienced a problem and its action had to be canceled. |

#### Reference

BuiltInFailuresDocumentFailures Class

Autodesk.Revit.DB Namespace